

document.getElementById("help_search").title = "החיפוש מבוסס על בסיס תגיות, פשוט תתחילו להקליד דברים שבא לכם למצוא והתוסף כבר יציע לכם תגיות מתאימיות, אפשר לחפש מספר תגיות במקביל וכמובן ניתן  לחפש שם של דף.\
לאחר מציאת הסרטון ניתן לשמור אותו פשוט לחצו על הכפתור שמירה השמאלי ותוכלו לראת אותו בכרטיסיה של \
Saved For Later\
כאשר תעמדו עם העכבר על קישור לסרטון תראו את כל הטאגים בהם העמוד תוייג וכך תוכלו לקבל מידע מלא אודות החומר המנצא בעמוד זה. \
טיפ מאתינו אליכם: ככל שהחיפוש יתבצע על מספר תגיות גדול יותר מספר התוצאות יהייה מצומצם וספציפי לאותם תאגים בלבד.";

document.getElementById("help_ranking").title = "במסך זה מדרגים את העמוד בו אתם נמצאים, לכל מקור ידע אותו אתם רוצים לדרג בוחרים בין כוכב אחד לחמש כך שחמש כוכבים זהו הציו הגבוהה ביותר. ניתן גם לתייג את העמוד בטאגים רלוונטיים כמו: גיטרה, פיזיקה, החוק השני של ניוטון וכו.\
כדי להפריד בין טאג לטאג יש להקיש על 'פסיק' ( ',') או ללחוץ על המקש ENTER. תוך כדי כתיבת טאג התוסף יציע לכם תיוגים קיימים כדי להשתמש בהם. מומלץ לתייג בפירוט כל עמוד כדי לאפשר למשתמשים נוספים להגיע למידע אותו אתם איתרתם וחשוב מכך, כדי שבפעם שתרצו להגיע לעמוד הזה תגיעו אליו במהירות ונוחות! \
חשוב לדעת: בגרסה זו של התוסף כל משתמש יכול לדרג ולתייג פעם אחת בלבד כל דף. ";

document.getElementById("help_saved").title = "אם שמרתם דף תוכלו לראות אותו כאן, לאחר שעברתם עליו והחלטתם שסיימת אותו - דרגו אותו- ואז תמחקו בסימן האיקס בצד שמאל של כל שורה    .";

document.getElementById("help_ranked").title = "בדומה למועדפים של הדפדפן כאן תוכלו לראות  דפים שאתם דירגתם כבר, כמובן שתוכלו לחפש בהם ולמצוא את הדפים האהובים עליכם לפי הדירוג שנתתם.";